package io.slatedb;

import io.slatedb.SlateDb.SlateDbException;
import io.slatedb.SlateDbConfig.*;

import java.lang.foreign.Arena;
import java.lang.foreign.FunctionDescriptor;
import java.lang.foreign.GroupLayout;
import java.lang.foreign.Linker;
import java.lang.foreign.MemoryLayout;
import java.lang.foreign.MemorySegment;
import java.lang.foreign.SegmentAllocator;
import java.lang.foreign.SymbolLookup;
import java.lang.foreign.ValueLayout;
import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.charset.StandardCharsets;
import java.util.Objects;

final class Native {
    private static final Linker LINKER = Linker.nativeLinker();
    private static final Object INIT_LOCK = new Object();

    private static final GroupLayout RESULT_LAYOUT = MemoryLayout.structLayout(
        ValueLayout.JAVA_INT.withName("kind"),
        ValueLayout.JAVA_INT.withName("close_reason"),
        ValueLayout.ADDRESS.withName("message")
    );

    private static final GroupLayout READ_OPTIONS_LAYOUT = MemoryLayout.structLayout(
        ValueLayout.JAVA_BYTE.withName("durability_filter"),
        ValueLayout.JAVA_BOOLEAN.withName("dirty"),
        ValueLayout.JAVA_BOOLEAN.withName("cache_blocks")
    );

    private static final GroupLayout PUT_OPTIONS_LAYOUT = MemoryLayout.structLayout(
        ValueLayout.JAVA_BYTE.withName("ttl_type"),
        MemoryLayout.paddingLayout(7),
        ValueLayout.JAVA_LONG.withName("ttl_value")
    );

    private static final GroupLayout WRITE_OPTIONS_LAYOUT = MemoryLayout.structLayout(
        ValueLayout.JAVA_BOOLEAN.withName("await_durable")
    );

    private static final GroupLayout BOUND_LAYOUT = MemoryLayout.structLayout(
        ValueLayout.JAVA_BYTE.withName("kind"),
        MemoryLayout.paddingLayout(7),
        ValueLayout.ADDRESS.withName("data"),
        ValueLayout.JAVA_LONG.withName("len")
    );

    private static final GroupLayout RANGE_LAYOUT = MemoryLayout.structLayout(
        BOUND_LAYOUT.withName("start"),
        BOUND_LAYOUT.withName("end")
    );

    private static final GroupLayout SCAN_OPTIONS_LAYOUT = MemoryLayout.structLayout(
        ValueLayout.JAVA_BYTE.withName("durability_filter"),
        ValueLayout.JAVA_BOOLEAN.withName("dirty"),
        MemoryLayout.paddingLayout(6),
        ValueLayout.JAVA_LONG.withName("read_ahead_bytes"),
        ValueLayout.JAVA_BOOLEAN.withName("cache_blocks"),
        MemoryLayout.paddingLayout(7),
        ValueLayout.JAVA_LONG.withName("max_fetch_tasks")
    );

    private static final GroupLayout READER_OPTIONS_LAYOUT = MemoryLayout.structLayout(
        ValueLayout.JAVA_LONG.withName("manifest_poll_interval_ms"),
        ValueLayout.JAVA_LONG.withName("checkpoint_lifetime_ms"),
        ValueLayout.JAVA_LONG.withName("max_memtable_bytes"),
        ValueLayout.JAVA_BOOLEAN.withName("skip_wal_replay"),
        MemoryLayout.paddingLayout(7)
    );

    private static final VarHandle RESULT_KIND =
        RESULT_LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("kind"));
    private static final VarHandle RESULT_MESSAGE =
        RESULT_LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("message"));

    private static final VarHandle READ_OPTIONS_DURABILITY =
        READ_OPTIONS_LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("durability_filter"));
    private static final VarHandle READ_OPTIONS_DIRTY =
        READ_OPTIONS_LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("dirty"));
    private static final VarHandle READ_OPTIONS_CACHE_BLOCKS =
        READ_OPTIONS_LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("cache_blocks"));

    private static final VarHandle PUT_OPTIONS_TTL_TYPE =
        PUT_OPTIONS_LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("ttl_type"));
    private static final VarHandle PUT_OPTIONS_TTL_VALUE =
        PUT_OPTIONS_LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("ttl_value"));

    private static final VarHandle WRITE_OPTIONS_AWAIT_DURABLE =
        WRITE_OPTIONS_LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("await_durable"));

    private static final VarHandle BOUND_KIND =
        BOUND_LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("kind"));
    private static final VarHandle BOUND_DATA =
        BOUND_LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("data"));
    private static final VarHandle BOUND_LEN =
        BOUND_LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("len"));

    private static final VarHandle SCAN_OPTIONS_DURABILITY =
        SCAN_OPTIONS_LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("durability_filter"));
    private static final VarHandle SCAN_OPTIONS_DIRTY =
        SCAN_OPTIONS_LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("dirty"));
    private static final VarHandle SCAN_OPTIONS_READ_AHEAD_BYTES =
        SCAN_OPTIONS_LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("read_ahead_bytes"));
    private static final VarHandle SCAN_OPTIONS_CACHE_BLOCKS =
        SCAN_OPTIONS_LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("cache_blocks"));
    private static final VarHandle SCAN_OPTIONS_MAX_FETCH_TASKS =
        SCAN_OPTIONS_LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("max_fetch_tasks"));

    private static final VarHandle READER_OPTIONS_MANIFEST_POLL_INTERVAL =
        READER_OPTIONS_LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("manifest_poll_interval_ms"));
    private static final VarHandle READER_OPTIONS_CHECKPOINT_LIFETIME =
        READER_OPTIONS_LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("checkpoint_lifetime_ms"));
    private static final VarHandle READER_OPTIONS_MAX_MEMTABLE_BYTES =
        READER_OPTIONS_LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("max_memtable_bytes"));
    private static final VarHandle READER_OPTIONS_SKIP_WAL_REPLAY =
        READER_OPTIONS_LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("skip_wal_replay"));

    private static final int ERROR_KIND_NONE = 0;
    private static final int ERROR_KIND_INVALID = 4;

    private static final byte BOUND_KIND_UNBOUNDED = 0;
    private static final byte BOUND_KIND_INCLUDED = 1;
    private static final byte BOUND_KIND_EXCLUDED = 2;

    private static final byte LOG_LEVEL_ERROR = 1;
    private static final byte LOG_LEVEL_WARN = 2;
    private static final byte LOG_LEVEL_INFO = 3;
    private static final byte LOG_LEVEL_DEBUG = 4;
    private static final byte LOG_LEVEL_TRACE = 5;

    private static final boolean VARHANDLE_REQUIRES_OFFSET =
        RESULT_KIND.coordinateTypes().size() == 2;

    private static volatile boolean initialized;

    private static MethodHandle initLoggingHandle;
    private static MethodHandle settingsDefaultHandle;
    private static MethodHandle settingsFromFileHandle;
    private static MethodHandle settingsFromJsonHandle;
    private static MethodHandle settingsFromEnvHandle;
    private static MethodHandle settingsLoadHandle;
    private static MethodHandle settingsToJsonHandle;
    private static MethodHandle settingsCloseHandle;

    private static MethodHandle objectStoreFromUrlHandle;
    private static MethodHandle objectStoreFromEnvHandle;
    private static MethodHandle objectStoreCloseHandle;

    private static MethodHandle openHandle;
    private static MethodHandle deleteHandle;
    private static MethodHandle flushHandle;
    private static MethodHandle scanHandle;
    private static MethodHandle scanPrefixHandle;
    private static MethodHandle metricsHandle;

    private static MethodHandle builderNewHandle;
    private static MethodHandle builderWithSettingsHandle;
    private static MethodHandle builderWithSstBlockSizeHandle;
    private static MethodHandle builderBuildHandle;
    private static MethodHandle builderFreeHandle;

    private static MethodHandle readerOpenHandle;
    private static MethodHandle readerGetHandle;
    private static MethodHandle readerScanHandle;
    private static MethodHandle readerScanPrefixHandle;
    private static MethodHandle readerCloseHandle;

    private static MethodHandle iteratorNextHandle;
    private static MethodHandle iteratorSeekHandle;
    private static MethodHandle iteratorCloseHandle;

    private static MethodHandle putHandle;
    private static MethodHandle getHandle;
    private static MethodHandle closeHandle;

    private static MethodHandle writeBatchNewHandle;
    private static MethodHandle writeBatchPutHandle;
    private static MethodHandle writeBatchPutWithOptionsHandle;
    private static MethodHandle writeBatchDeleteHandle;
    private static MethodHandle writeBatchWriteHandle;
    private static MethodHandle writeBatchCloseHandle;

    private static MethodHandle freeResultHandle;
    private static MethodHandle freeBytesHandle;

    private static final GroupLayout WRITE_HANDLE_LAYOUT = MemoryLayout.structLayout(
        ValueLayout.JAVA_LONG.withName("seq"),
        ValueLayout.JAVA_LONG.withName("create_ts"),
        ValueLayout.JAVA_BOOLEAN.withName("create_ts_present"),
        MemoryLayout.paddingLayout(7)
    ).withName("slatedb_write_handle_t");

    private static final VarHandle WRITE_HANDLE_SEQ =
        WRITE_HANDLE_LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("seq"));
    private static final VarHandle WRITE_HANDLE_CREATE_TS =
        WRITE_HANDLE_LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("create_ts"));
    private static final VarHandle WRITE_HANDLE_CREATE_TS_PRESENT =
        WRITE_HANDLE_LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("create_ts_present"));

    private static int getInt(VarHandle handle, MemorySegment segment) {
        return (int) (VARHANDLE_REQUIRES_OFFSET ? handle.get(segment, 0L) : handle.get(segment));
    }

    private static long getLong(VarHandle handle, MemorySegment segment) {
        return (long) (VARHANDLE_REQUIRES_OFFSET ? handle.get(segment, 0L) : handle.get(segment));
    }

    private static MemorySegment getAddress(VarHandle handle, MemorySegment segment) {
